package home_work_5;
/*
6. Работа с коллекциями. Выполняем действия над экземплярами классов созданных на основания задания 1:
	6.0* В идеале можно, используя полиморфизм, написать метод который будет выполнять основную работу над коллекциями наполненными любыми данными + методы для каждого из
	     класса из пункта 1. Например метод который генерирует Person и заполняет ими указанную вами коллекцию указанным количеством  Person. Получившуюся коллекцию передаём
	     во второй метод который выполняет все остальные прописанные действия.
	6.1. При помощи рандома генерируем 1_000_000 (Если компьютер глючит сделать 100_000) разных объектов одного класса. Поля заполняются рандомными данными.
	6.2. Заполняем:
		6.2.1. LinkedList
		6.2.2. ArrayList
		6.2.3. HashSet
		6.2.4. TreeSet
	6.3. Отсортировать коллекции используя компараторы созданные в этом ДЗ.
		6.3.1. Сортируем встроенными средствами jdk
		6.3.2.* Сортируем собственным методом сортировки
	6.4. Замерить время и распечатать в консоль скорость каждой перечисленной операции: "Операция: ХХХХ. Заняла YYYY мс". Для замера использовать метод из jdk System.currentTimeMillis():
		6.4.1. Заполнения коллекции
		6.4.2. Итерирования коллекции:
			6.4.2.1. При помощи iterator
			6.4.2.2. При помощи любого другого способа (не foreach)
		6.4.3. Удаления всех элементов коллекции (выбрать один из):
			6.4.3.1. При помощи iterator
			6.4.3.2. При помощи любого другого способа
 */
public class OperationsWithCollections {
}
